# Лабораторная работа №3

In [1]:
!pwd

/Users/artyem.petrov/dev/university/4-1/machine-learning-basics-and-neural-networks/lab03

In [2]:
!../.venv/bin/pip install pandas

Collecting pandas
  Using cached pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl.metadata (91 kB)
Requirement already satisfied: numpy>=1.26.0 in /Users/artyem.petrov/dev/university/4-1/machine-learning-basics-and-neural-networks/.venv/lib/python3.13/site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/artyem.petrov/dev/university/4-1/machine-learning-basics-and-neural-networks/.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: tzdata>=2022.7 in /Users/artyem.petrov/dev/university/4-1/machine-learning-basics-and-neural-networks/.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /Users/artyem.petrov/dev/university/4-1/machine-learning-basics-and-neural-networks/.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl (10.7 MB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Installing collected packages: pytz, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2/2 [pandas]━━━━ 1/2 [pandas]
Successfully installed pandas-2.3.3 pytz-2025.2

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: /Users/artyem.petrov/dev/university/4-1/machine-learning-basics-and-neural-networks/.venv/bin/python -m pip install --upgrade pip

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("titanic_train.csv", sep=",")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 1. Какова доля семей, в которых минимальный возраст меньше 20 (семьи с детьми)?

In [5]:
df['LastName'] = df['Name'].str.split(',').str[0]

family_min_age = df.groupby('LastName')['Age'].min().reset_index()
family_min_age.columns = ['LastName', 'MinAge']

families_with_children = family_min_age[family_min_age['MinAge'] < 20]
total_families = len(family_min_age)

proportion = len(families_with_children) / total_families

print(f"Количество всех семей: {total_families}")
print(f"Количество семей с детьми (мин. возраст < 20): {len(families_with_children)}")
print(f"Доля семей с детьми: {proportion:.4f} ({proportion*100:.2f}%)")

Количество всех семей: 667
Количество семей с детьми (мин. возраст < 20): 124
Доля семей с детьми: 0.1859 (18.59%)

### 2. Какова доля выживших пассажиров класса 3? А пассажиров класса 1?

In [6]:
# Доля выживших пассажиров 3 класса
class_3_survived = df[(df['Pclass'] == 3) & (df['Survived'] == 1)]
class_3_total = df[df['Pclass'] == 3]
survival_rate_class_3 = len(class_3_survived) / len(class_3_total)

# Доля выживших пассажиров 1 класса
class_1_survived = df[(df['Pclass'] == 1) & (df['Survived'] == 1)]
class_1_total = df[df['Pclass'] == 1]
survival_rate_class_1 = len(class_1_survived) / len(class_1_total)

print("=== ДОЛЯ ВЫЖИВШИХ ПАССАЖИРОВ ===")
print(f"Пассажиры 3 класса:")
print(f"  Всего пассажиров: {len(class_3_total)}")
print(f"  Выжило: {len(class_3_survived)}")
print(f"  Доля выживших: {survival_rate_class_3:.4f} ({survival_rate_class_3*100:.2f}%)")

print(f"\nПассажиры 1 класса:")
print(f"  Всего пассажиров: {len(class_1_total)}")
print(f"  Выжило: {len(class_1_survived)}")
print(f"  Доля выживших: {survival_rate_class_1:.4f} ({survival_rate_class_1*100:.2f}%)")

=== ДОЛЯ ВЫЖИВШИХ ПАССАЖИРОВ ===
Пассажиры 3 класса:
  Всего пассажиров: 491
  Выжило: 119
  Доля выживших: 0.2424 (24.24%)

Пассажиры 1 класса:
  Всего пассажиров: 216
  Выжило: 136
  Доля выживших: 0.6296 (62.96%)

### 3. Сколько пассажиров выжило, а сколько - нет?

In [8]:
survival_counts = df['Survived'].value_counts().sort_index()
total_passengers = len(df)

print("=== СТАТИСТИКА ВЫЖИВАНИЯ НА ТИТАНИКЕ ===")
print(f"Общее количество пассажиров: {total_passengers}")

print(f"\nВыжившие (Survived = 1): {survival_counts.get(1, 0)} пассажиров")
print(f"Погибшие (Survived = 0): {survival_counts.get(0, 0)} пассажиров")

# Расчет долей
survival_rate = survival_counts.get(1, 0) / total_passengers
death_rate = survival_counts.get(0, 0) / total_passengers

=== СТАТИСТИКА ВЫЖИВАНИЯ НА ТИТАНИКЕ ===
Общее количество пассажиров: 891

Выжившие (Survived = 1): 342 пассажиров
Погибшие (Survived = 0): 549 пассажиров

### 4. Создайте столбец 'IsChild', который равен 1, если возраст меньше 20, и 0 - иначе. Для пропущенных значений поведение функции может быть произвольным.

In [15]:
df['IsChild'] = df['Age'].apply(lambda x: 1 if x < 20 else 0 if pd.notnull(x) else np.nan)

df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,LastName,IsChild
462,463,0,1,"Gee, Mr. Arthur H",male,47.0,0,0,111320,38.5000,E63,S,Gee,0.0
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C,Harper,0.0
215,216,1,1,"Newell, Miss. Madeleine",female,31.0,1,0,35273,113.2750,D36,C,Newell,0.0
260,261,0,3,"Smith, Mr. Thomas",male,NaN,0,0,384461,7.7500,NaN,Q,Smith,NaN
591,592,1,1,"Stephenson, Mrs. Walter Bertram (Martha Eustis)",female,52.0,1,0,36947,78.2667,D20,C,Stephenson,0.0
248,249,1,1,"Beckwith, Mr. Richard Leonard",male,37.0,1,1,11751,52.5542,D35,S,Beckwith,0.0
111,112,0,3,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,Zabour,1.0
655,656,0,2,"Hickman, Mr. Leonard Mark",male,24.0,2,0,S.O.C. 14879,73.5000,NaN,S,Hickman,0.0
629,630,0,3,"O'Connell, Mr. Patrick D",male,NaN,0,0,334912,7.7333,NaN,Q,O'Connell,NaN
110,111,0,1,"Porter, Mr. Walter Chamberlain",male,47.0,0,0,110465,52.0000,C110,S,Porter,0.0

### 5. Какова доля выживших женщин из первого класса? А доля выживших мужчин из 3 класса?

In [16]:
# Доля выживших женщин из первого класса
women_1class = df[(df['Sex'] == 'female') & (df['Pclass'] == 1)]
rate_women_1class = women_1class['Survived'].mean()
print(f"Доля выживших женщин 1 класса: {rate_women_1class:.3f}")

# Доля выживших мужчин из третьего класса
men_3class = df[(df['Sex'] == 'male') & (df['Pclass'] == 3)]
rate_men_3class = men_3class['Survived'].mean()
print(f"Доля выживших мужчин 3 класса: {rate_men_3class:.3f}")

Доля выживших женщин 1 класса: 0.968
Доля выживших мужчин 3 класса: 0.135

## Часть 2. (Оценки студентов)

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:

    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

In [24]:
!pwd

!ls ../'25-26 ОМОиНС (студентам)'/Data

/Users/artyem.petrov/dev/university/4-1/machine-learning-basics-and-neural-networks/lab03
Students_info_0.csv  Students_info_7.csv  Students_marks_4.csv
Students_info_1.csv  Students_info_8.csv  Students_marks_5.csv
Students_info_2.csv  Students_info_9.csv  Students_marks_6.csv
Students_info_3.csv  Students_marks_0.csv Students_marks_7.csv
Students_info_4.csv  Students_marks_1.csv Students_marks_8.csv
Students_info_5.csv  Students_marks_2.csv Students_marks_9.csv
Students_info_6.csv  Students_marks_3.csv

### Задача 2.1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.

In [32]:
all_students = []

base_path = '/Users/artyem.petrov/dev/university/4-1/machine-learning-basics-and-neural-networks/25-26 ОМОиНС (студентам)/Data'

for i in range(0, 10):
    info_file = f"{base_path}/Students_info_{i}.csv"
    marks_file = f"{base_path}/Students_marks_{i}.csv"
    
    info_df = pd.read_csv(info_file)
    marks_df = pd.read_csv(marks_file)
    
    merged_df = pd.merge(info_df, marks_df, on='index')
    merged_df['group'] = i
    
    all_students.append(merged_df)

df = pd.concat(all_students, ignore_index=True)

df.head()

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,0,female,group B,bachelor's degree,standard,none,0,72,72,74
1,1,female,group C,some college,standard,completed,0,69,90,88
2,2,female,group B,master's degree,standard,none,0,90,95,93
3,3,male,group A,associate's degree,free/reduced,none,0,47,57,44
4,4,male,group C,some college,standard,none,0,76,78,75

### Задание 2.2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [33]:
df_test = df.drop('index', axis=1)

df_test.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,0,72,72,74
1,female,group C,some college,standard,completed,0,69,90,88
2,female,group B,master's degree,standard,none,0,90,95,93
3,male,group A,associate's degree,free/reduced,none,0,47,57,44
4,male,group C,some college,standard,none,0,76,78,75

### Задание 2.3. Выведите на экран размеры полученной таблицы

In [34]:
df.shape

(1000, 10)

### Задание 2.4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [35]:
df.describe()

             index        group  math score  reading score  writing score
count  1000.000000  1000.000000  1000.00000    1000.000000    1000.000000
mean    499.500000     4.500000    66.08900      69.169000      68.054000
std     288.819436     2.873719    15.16308      14.600192      15.195657
min       0.000000     0.000000     0.00000      17.000000      10.000000
25%     249.750000     2.000000    57.00000      59.000000      57.750000
50%     499.500000     4.500000    66.00000      70.000000      69.000000
75%     749.250000     7.000000    77.00000      79.000000      79.000000
max     999.000000     9.000000   100.00000     100.000000     100.000000

### Задание 2.5. Проверьте, есть ли в таблице пропущенные значения

In [36]:
df.isnull().sum()

index                          0
gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
group                          0
math score                     0
reading score                  0
writing score                  0
dtype: int64

### Задание 2.6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [37]:
print(f"Средний балл по математике: {df['math score'].mean():.2f}")
print(f"Средний балл по чтению: {df['reading score'].mean():.2f}")
print(f"Средний балл по письму: {df['writing score'].mean():.2f}")

Средний балл по математике: 66.09
Средний балл по чтению: 69.17
Средний балл по письму: 68.05

### Задание 2.7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.

In [38]:
print("Средние баллы по математике:")
print(df.groupby('test preparation course')['math score'].mean())
print("\nСредние баллы по чтению:")
print(df.groupby('test preparation course')['reading score'].mean())
print("\nСредние баллы по письму:")
print(df.groupby('test preparation course')['writing score'].mean())

Средние баллы по математике:
test preparation course
completed    69.695531
none         64.077882
Name: math score, dtype: float64

Средние баллы по чтению:
test preparation course
completed    73.893855
none         66.534268
Name: reading score, dtype: float64

Средние баллы по письму:
test preparation course
completed    74.418994
none         64.504673
Name: writing score, dtype: float64

### Задание 2.8. Выведите на экран все различные значения из столбца lunch.

In [39]:
print(df['lunch'].unique())

['standard' 'free/reduced']

### Задание 2.9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [42]:
df = df.rename(columns={
    'parental level of education': 'education',
    'test preparation course': 'test preparation'
})

df.columns

Index(['index', 'gender', 'race/ethnicity', 'education', 'lunch',
       'test preparation', 'group', 'math score', 'reading score',
       'writing score'],
      dtype='object')

**Зафиксируем минимальный балл для сдачи экзамена**

In [41]:
passmark = 50

### Задание 2.10. 
**Ответьте на вопросы:**

    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?  
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?  
    * Какая доля девушек, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [62]:
math_passed = (df['math score'] >= passmark).mean()
print(f"Доля студентов, сдавших математику: {math_passed:.3f}")

Доля студентов, сдавших математику: 0.865

In [63]:
prepared_passed = (df[df['test preparation'] == 'completed']['math score'] >= passmark).mean()
print(f"Доля студентов с подготовкой, сдавших математику: {prepared_passed:.3f}")

Доля студентов с подготовкой, сдавших математику: 0.922

In [64]:
girls_not_prepared_failed = (
    (df['gender'] == 'female') & 
    (df['test preparation'] == 'none') & 
    (df['math score'] < passmark)
).mean()
print(f"Доля девушек без подготовки, не сдавших математику: {girls_not_prepared_failed:.3f}")

Доля девушек без подготовки, не сдавших математику: 0.070

### Задание 2.11. 
**С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**  

    * Для каждой этнической группы выведите средний балл за экзамен по чтению  
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [57]:
import time

In [53]:
# 1. Для каждой этнической группы - средний балл по чтению
start_time = time.time()
reading_by_ethnicity = df.groupby('race/ethnicity')['reading score'].mean()
print("Средний балл по чтению для каждой этнической группы:")
print(reading_by_ethnicity)
print(f"Время выполнения: {time.time() - start_time:.4f} секунд\n")

Средний балл по чтению для каждой этнической группы:
race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64
Время выполнения: 0.0034 секунд

In [58]:
# 2. Для каждого уровня образования - минимальный балл по письму
start_time = time.time()
writing_by_education = df.groupby('education')['writing score'].min()
print("Минимальный балл по письму для каждого уровня образования:")
print(writing_by_education)
print(f"Время выполнения: {time.time() - start_time:.4f} секунд")

Минимальный балл по письму для каждого уровня образования:
education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64
Время выполнения: 0.0014 секунд

### Задание 2.12. 
**Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [59]:
# 1. Для каждой этнической группы - средний балл по чтению (циклом)
start_time = time.time()
ethnic_groups = df['race/ethnicity'].unique()
reading_means_loop = {}

for group in ethnic_groups:
    group_scores = df[df['race/ethnicity'] == group]['reading score']
    reading_means_loop[group] = group_scores.mean()

print("Средний балл по чтению для каждой этнической группы (циклом):")
for group, mean_score in reading_means_loop.items():
    print(f"{group}: {mean_score:.2f}")
loop1_time = time.time() - start_time
print(f"Время выполнения: {loop1_time:.4f} секунд\n")

Средний балл по чтению для каждой этнической группы (циклом):
group B: 67.35
group C: 69.10
group A: 64.67
group D: 70.03
group E: 73.03
Время выполнения: 0.0029 секунд

In [60]:
# 2. Для каждого уровня образования - минимальный балл по письму (циклом)
start_time = time.time()
education_levels = df['education'].unique()
writing_mins_loop = {}

for level in education_levels:
    level_scores = df[df['education'] == level]['writing score']
    writing_mins_loop[level] = level_scores.min()

print("Минимальный балл по письму для каждого уровня образования (циклом):")
for level, min_score in writing_mins_loop.items():
    print(f"{level}: {min_score}")
loop2_time = time.time() - start_time
print(f"Время выполнения: {loop2_time:.4f} секунд")

Минимальный балл по письму для каждого уровня образования (циклом):
bachelor's degree: 38
some college: 19
master's degree: 46
associate's degree: 35
high school: 15
some high school: 10
Время выполнения: 0.0063 секунд

### Задание 2.13. 
**Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [49]:
pivot_table = df.pivot_table(
    values=['math score', 'reading score', 'writing score'],
    index=['gender', 'education'],
    aggfunc='mean'
)

pivot_table

                           math score  reading score  writing score
gender education
female associate's degree   65.250000      74.120690      74.000000
       bachelor's degree    68.349206      77.285714      78.380952
       high school          59.351064      68.202128      66.691489
       master's degree      66.500000      76.805556      77.638889
       some college         65.406780      73.550847      74.050847
       some high school     59.296703      69.109890      68.285714
male   associate's degree   70.764151      67.433962      65.405660
       bachelor's degree    70.581818      68.090909      67.654545
       high school          64.705882      61.480392      58.539216
       master's degree      74.826087      73.130435      72.608696
       some college         69.009259      64.990741      63.148148
       some high school     67.840909      64.693182      61.375000

### Задание 2.14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [79]:
df['Math_PassStatus'] = df['math score'].apply(lambda x: 'P' if x >= 50 else 'F')

math_pass_count = df['Math_PassStatus'].value_counts()

print(f"Результаты экзамена по математике:")
math_pass_count

Результаты экзамена по математике:

Math_PassStatus
P    865
F    135
Name: count, dtype: int64

In [80]:
df['Reading_PassStatus'] = df['reading score'].apply(lambda x: 'P' if x >= 50 else 'F')

reading_pass_count = df['Reading_PassStatus'].value_counts()

print("Результаты экзамена по чтению:")
reading_pass_count

Результаты экзамена по чтению:

Reading_PassStatus
P    910
F     90
Name: count, dtype: int64

In [81]:
df['Writing_PassStatus'] = df['writing score'].apply(lambda x: 'P' if x >= 50 else 'F')
writing_pass_count = df['Writing_PassStatus'].value_counts()

print("Результаты экзамена по письму:")
writing_pass_count

Результаты экзамена по письму:

Writing_PassStatus
P    886
F    114
Name: count, dtype: int64

### Задание 2.15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [82]:
df['OverAll_PassStatus'] = df.apply(
    lambda row: 'P' if (row['math score'] >= 50 and 
                       row['reading score'] >= 50 and 
                       row['writing score'] >= 50) else 'F', 
    axis=1
)

overall_pass_count = df['OverAll_PassStatus'].value_counts()
print("Результаты по всем экзаменам:")

print(overall_pass_count)

print(f"\nКоличество студентов, сдавших все экзамены: {overall_pass_count.get('P', 0)}")

Результаты по всем экзаменам:
OverAll_PassStatus
P    812
F    188
Name: count, dtype: int64

Количество студентов, сдавших все экзамены: 812